#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.db_password: Refreshing state... [id=none]
aws_cloudwatch_event_rule.request_queue: Refreshing state... [id=request-queue-scheduler]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:882670198625:certificate/362f2f66-1423-4c5f-a0f5-d79c71d21f78]
aws_iam_role.redis_container_role[0]: Refreshing state... [id=redis-container-role]
data.aws_subnet.a_data: Reading...
data.aws_security_group.app: Reading...
data.aws_subnet.b_data: Reading...
data.aws_vpc.selected: Reading...
module.db.data.aws_partition.current: Reading...
data.aws_subnet.a: Reading...
aws_acm_certificate.status: Refreshing state... [id=arn:aws:acm:ca-central-1:882670198625:certificate/bb67118a-d5fb-4bb0-8c58-424b1d6333cf]
module.db.data.aws_partition.current: Read complete after 0s [id=aws]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=kcbkts0s8a]
data.aws_security_group.web: Reading...
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-test-keycloak]
data.aws_iam_policy_document.ecs_task_execution_role: Reading...
data.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=1077804475]
module.s3_sso_api_swagger.aws_s3_bucket.this: Refreshing state... [id=xgr00q-test-api-swagger]
data.aws_subnet.a: Read complete after 0s [id=subnet-0bc624d1ab6e8e88f]
data.aws_iam_policy.permissions_boundary_policy: Reading...
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
data.aws_subnet.a_data: Read complete after 0s [id=subnet-0f1500aaed6236692]
aws_ecs_cluster.sso_ecs_cluster: Refreshing state... [id=arn:aws:ecs:ca-central-1:882670198625:cluster/sso-ecs-cluster]
data.aws_subnet.b_data: Read complete after 0s [id=subnet-01090b42f500c6447]
aws_dynamodb_table.state_locking: Refreshing state... [id=xgr00q-test-state-locking]
aws_cloudwatch_event_rule.request_monitor: Refreshing state... [id=request-monitor-scheduler]
data.aws_security_group.app: Read complete after 0s [id=sg-0d4f0195cfa9c08ac]
aws_iam_role.api_gateway_s3_role: Refreshing state... [id=ApiGatewayAmazonS3AccessRole]
data.aws_security_group.web: Read complete after 0s [id=sg-0abd4080abadbeb0d]
data.aws_subnet.b: Reading...
aws_iam_role_policy.redis_cwlogs[0]: Refreshing state... [id=redis-container-role:redis-cw-logs]
data.aws_subnet.b: Read complete after 0s [id=subnet-080f02b63c4516aac]
aws_api_gateway_resource.app: Refreshing state... [id=c216sf]
aws_api_gateway_resource.openapi_swagger: Refreshing state... [id=23yvm4]
aws_api_gateway_resource.api: Refreshing state... [id=xyqr7p]
aws_apigatewayv2_domain_name.this: Refreshing state... [id=api-test.loginproxy.gov.bc.ca]
aws_alb.sso_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:882670198625:loadbalancer/app/sso-alb/2513e229b7f3f9f4]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20240523164749443800000004]
aws_ecs_cluster_capacity_providers.sso_ecs_cluster_capacity_providers: Refreshing state... [id=sso-ecs-cluster]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_resource.app_proxy: Refreshing state... [id=durnz2]
data.aws_vpc.selected: Read complete after 0s [id=vpc-0da3b0e781594bff3]
aws_api_gateway_resource.api_proxy: Refreshing state... [id=qtwbra]
aws_api_gateway_resource.openapi_swagger_proxy: Refreshing state... [id=c4u2t7]
aws_api_gateway_resource.swagger_assets_proxy: Refreshing state... [id=d3qwx0]
aws_security_group.rds_sg: Refreshing state... [id=sg-078ec4a8ff14313df]
aws_lb_target_group.redis[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:882670198625:targetgroup/redis/a5fa6407bea376ce]
aws_api_gateway_method.app_proxy: Refreshing state... [id=agm-kcbkts0s8a-durnz2-ANY]
aws_apigatewayv2_api_mapping.this: Refreshing state... [id=6rcvcr]
aws_api_gateway_method.api_proxy: Refreshing state... [id=agm-kcbkts0s8a-qtwbra-ANY]
aws_api_gateway_method.openapi_swagger_proxy: Refreshing state... [id=agm-kcbkts0s8a-c4u2t7-GET]
aws_api_gateway_method.swagger_assets_proxy: Refreshing state... [id=agm-kcbkts0s8a-d3qwx0-GET]
aws_lb.redis_nlb[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:882670198625:loadbalancer/net/redis-nlb/97b762812053af45]
aws_api_gateway_method_response.openapi_swagger_proxy: Refreshing state... [id=agmr-kcbkts0s8a-c4u2t7-GET-200]
aws_api_gateway_method_response.swagger_assets_proxy: Refreshing state... [id=agmr-kcbkts0s8a-d3qwx0-GET-200]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
module.s3_keycloak_v2.aws_s3_bucket_versioning.this: Refreshing state... [id=xgr00q-test-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-test-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-test-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-test-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-test-keycloak,private]
module.s3_keycloak_v2.data.aws_iam_policy_document.deny_non_secure_access_doc: Reading...
module.s3_keycloak_v2.data.aws_iam_policy_document.deny_non_secure_access_doc: Read complete after 0s [id=2169713932]
module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-test-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-test-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_versioning.this: Refreshing state... [id=xgr00q-test-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-test-api-swagger,private]
module.s3_sso_api_swagger.data.aws_iam_policy_document.deny_non_secure_access_doc: Reading...
module.s3_sso_api_swagger.data.aws_iam_policy_document.deny_non_secure_access_doc: Read complete after 0s [id=1476409885]
module.s3_keycloak_v2.aws_s3_bucket_policy.deny_non_secure_access_policy: Refreshing state... [id=xgr00q-test-keycloak]
aws_api_gateway_integration.openapi_swagger: Refreshing state... [id=agi-kcbkts0s8a-c4u2t7-GET]
aws_iam_role_policy.s3_read_access_policy: Refreshing state... [id=ApiGatewayAmazonS3AccessRole:AWSS3ResourceReadAccessRolePolicy]
aws_api_gateway_integration.openapi_swagger_assets: Refreshing state... [id=agi-kcbkts0s8a-d3qwx0-GET]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"]: Refreshing state... [id=swagger-ui-es-bundle.js]
aws_s3_object.swagger_dist["swagger-ui.css"]: Refreshing state... [id=swagger-ui.css]
aws_s3_object.swagger_dist["swagger-initializer.js"]: Refreshing state... [id=swagger-initializer.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"]: Refreshing state... [id=swagger-ui-es-bundle-core.js]
aws_s3_object.swagger_dist["README.md"]: Refreshing state... [id=README.md]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"]: Refreshing state... [id=swagger-ui-standalone-preset.js]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"]: Refreshing state... [id=swagger-ui-standalone-preset.js.map]
data.aws_iam_policy.permissions_boundary_policy: Read complete after 1s [id=arn:aws:iam::882670198625:policy/sso-requests-boundary]
aws_s3_object.swagger_dist["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
aws_s3_object.swagger_dist["index.js"]: Refreshing state... [id=index.js]
aws_s3_object.swagger_dist["package.json"]: Refreshing state... [id=package.json]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"]: Refreshing state... [id=swagger-ui-es-bundle.js.map]
aws_s3_object.swagger_dist["index.css"]: Refreshing state... [id=index.css]
aws_s3_object.swagger_dist["swagger-ui.js.map"]: Refreshing state... [id=swagger-ui.js.map]
aws_s3_object.swagger_dist["oauth2-redirect.html"]: Refreshing state... [id=oauth2-redirect.html]
aws_s3_object.swagger_dist["swagger-output.json"]: Refreshing state... [id=swagger-output.json]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"]: Refreshing state... [id=swagger-ui-es-bundle-core.js.map]
aws_s3_object.swagger_dist["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.swagger_dist["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
aws_s3_object.swagger_dist["swagger-ui-bundle.js"]: Refreshing state... [id=swagger-ui-bundle.js]
aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"]: Refreshing state... [id=swagger-ui-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui.js"]: Refreshing state... [id=swagger-ui.js]
aws_s3_object.swagger_dist["swagger-ui.css.map"]: Refreshing state... [id=swagger-ui.css.map]
aws_s3_object.swagger_dist["absolute-path.js"]: Refreshing state... [id=absolute-path.js]
module.s3_sso_api_swagger.aws_s3_bucket_policy.deny_non_secure_access_policy: Refreshing state... [id=xgr00q-test-api-swagger]
aws_lb_listener.redis[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:882670198625:listener/net/redis-nlb/97b762812053af45/1c79f84af2d1a81f]
aws_api_gateway_integration_response.openapi_swagger_assets: Refreshing state... [id=agir-kcbkts0s8a-d3qwx0-GET-200]
aws_api_gateway_integration_response.openapi_swagger: Refreshing state... [id=agir-kcbkts0s8a-c4u2t7-GET-200]
aws_iam_role.redis_task_execution_role[0]: Refreshing state... [id=RedisECSTaskExecutionRole]
aws_lambda_function.css_api: Refreshing state... [id=lambda-css-api]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.request_monitor: Refreshing state... [id=request-monitor]
aws_lambda_function.request_queue: Refreshing state... [id=request-queue]
aws_iam_role_policy.redis_task_execution_cwlogs[0]: Refreshing state... [id=RedisECSTaskExecutionRole:redis-task-exec-cwlogs]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_ecs_task_definition.redis[0]: Refreshing state... [id=redis]
aws_api_gateway_integration.app: Refreshing state... [id=agi-kcbkts0s8a-durnz2-ANY]
aws_cloudwatch_event_target.request_queue: Refreshing state... [id=request-queue-scheduler-request_queue]
aws_lambda_permission.request_queue: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_lambda_permission.request_monitor: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.request_monitor: Refreshing state... [id=request-monitor-scheduler-request_monitor]
aws_lambda_permission.apigw_api: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.api: Refreshing state... [id=agi-kcbkts0s8a-qtwbra-ANY]
aws_ecs_service.redis[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:882670198625:service/sso-ecs-cluster/redis]
aws_api_gateway_deployment.this: Refreshing state... [id=lps2zi]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.db.aws_rds_cluster.this[0] has changed
  ~ resource "aws_rds_cluster" "this" {
      ~ engine_version_actual                 = "13.15" -> "13.18"
        id                                    = "aurora-db-postgres"
        tags                                  = {
            "managed-by" = "terraform"
        }
        # (60 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "db" {
      + function_name = "lambda-db"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_acm_certificate.status will be created
  + resource "aws_acm_certificate" "status" {
      + arn                       = (known after apply)
      + domain_name               = "status.sandbox.loginproxy.gov.bc.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "status.sandbox.loginproxy.gov.bc.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "status.sandbox.loginproxy.gov.bc.ca",
        ]
      + tags_all                  = {
          + "repository" = "sso-requests"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2025-05-08T15:55:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "xn4q6bg0HQl0z8ZDE/t8JOoLsbJimaVt7/0Mycyzsa0=" -> "/UhAy2wzk+hBmPVzpd/49770bSdtg03g2wZ3OHbHGEE="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GH_ACCESS_TOKEN"                 = (sensitive value)
                # (44 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be updated in-place
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2025-05-08T15:55:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "3/UdMLdVuo5+WhvDHYGNhg8/KuPVs+/+ax3xb4RGfh8=" -> "gg04Nkj+/qDYpOxncVLTHtK1WFuiV1On0VmCnwfhKIc="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GH_ACCESS_TOKEN"            = (sensitive value)
                # (29 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2025-05-08T15:55:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "kVaaxXiDRradx0tc4KZ2pUPLYpciLu0b+Qhrq113XyY=" -> "yHLZg7BTcLMnIShUIyi+GvhwWFktgdD3QaOuNZBtdn8="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.request_monitor will be updated in-place
  ~ resource "aws_lambda_function" "request_monitor" {
        id                             = "request-monitor"
      ~ last_modified                  = "2025-05-08T15:55:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "mW4hEuEWOVAnt3eLXcGIfdNRnANyJMob16+AsSo6yAk=" -> "WwV8VC/vapZ7TMijNU5zOT19Qx+ZB3+P2eul8xPDnbs="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.request_queue will be updated in-place
  ~ resource "aws_lambda_function" "request_queue" {
        id                             = "request-queue"
      ~ last_modified                  = "2025-05-08T15:55:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "ojcq2T80DvyK5gldD3WYFYhtEYsiS26POKGwP/VH3eA=" -> "+xCzUwNcnLY+oUHuNryfutHHM4D/Tz/ht4uO3Ho16WA="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2025-05-08T15:55:43.377Z"
        }
      - statusCode = 200
    } -> (known after apply)

Warning: Argument is deprecated

  with aws_api_gateway_deployment.this,
  on api-gateway.tf line 197, in resource "aws_api_gateway_deployment" "this":
 197:   stage_name  = "test"

stage_name is deprecated. Use the aws_api_gateway_stage resource instead.

Warning: Deprecated attribute

  on api-gateway.tf line 227, in output "base_url":
 227:   value = aws_api_gateway_deployment.this.invoke_url

The attribute "invoke_url" is deprecated. Refer to the provider documentation
for details.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jlangy, Action: `pull_request`*